//
//  HiraganaKatakana.swift
//  OCRSample
//
//  Created by 김호성 on 2024.11.16.
//

import Foundation

class HiraganaKatakanaManager {
    public static let shared = HiraganaKatakanaManager()
    private init() {}
    
    let hiraganaKatakana: [String] = [
        "あ", "い", "う", "え", "お",
        "か", "き", "く", "け", "こ",
        "さ", "し", "す", "せ", "そ",
        "た", "ち", "つ", "て", "と",
        "な", "に", "ぬ", "ね", "の",
        "は", "ひ", "ふ", "へ", "ほ",
        "ま", "み", "む", "め", "も",
        "や",      "ゆ",       "よ",
        "ら", "り", "る", "れ", "ろ",
        "わ",                 "を",
        "ん",
        
        "ア", "イ", "ウ", "エ", "オ",
        "カ", "キ", "ク", "ケ", "コ",
        "サ", "シ", "ス", "セ", "ソ",
        "タ", "チ", "ツ", "テ", "ト",
        "ナ", "ニ", "ヌ", "ネ", "ノ",
        "ハ", "ヒ", "フ", "ヘ", "ホ",
        "マ", "ミ", "ム", "メ", "モ",
        "ヤ",      "ユ",       "ヨ",
        "ラ", "リ", "ル", "レ", "ロ",
        "ワ",                 "ヲ",
        "ン",
    ]
    let hiragana: String = "あいうえおかきくけこさしすせそたちってとなにぬねのはひふへほまみむめもやゆよらりるれろわをん"
    let katakana: String = "アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフへホマミムメモヤユヨラリルレロワヲン"
    
    let hiraganaTuple: [(String, String)] = [
        ("あ", "아 a"), ("い", "이 i"), ("う", "우 u"), ("え", "에 e"), ("お", "오 o"),
        ("か", "카 ka"), ("き", "키 ki"), ("く", "쿠 ku"), ("け", "케 ke"), ("こ", "코 ko"),
        ("さ", "사 sa"), ("し", "시 si"), ("す", "스 su"), ("せ", "세 se"), ("そ", "소 so"),
        ("た", "타 ta"), ("ち", "치 chi"), ("つ", "츠 tsu"), ("て", "테 te"), ("と", "토 to"),
        ("な", "나 na"), ("に", "니 ni"), ("ぬ", "누 nu"), ("ね", "네 ne"), ("の", "노 no"),
        ("は", "하 ha"), ("ひ", "히 hi"), ("ふ", "후 hu"), ("へ", "헤 he"), ("ほ", "호 ho"),
        ("ま", "마 ma"), ("み", "미 mi"), ("む", "무 mu"), ("め", "메 me"), ("も", "모 mo"),
        ("や", "야 ya"), ("", ""), ("ゆ", "유 yu"), ("", ""), ("よ", "요 yo"),
        ("ら", "라 ra"), ("り", "리 ri"), ("る", "루 ru"), ("れ", "레 re"), ("ろ", "로 ro"),
        ("わ", "와 wa"), ("", ""), ("", ""), ("", ""), ("を", "오 wo"),
        ("ん", "응 n"), ("", ""), ("", ""), ("", ""), ("", ""),
    ]
    
    let katakanaTuple: [(String, String)] = [
        ("ア", "아 a"), ("イ", "이 i"), ("ウ", "우 u"), ("エ", "에 e"), ("オ", "오 o"),
        ("カ", "카 ka"), ("キ", "키 ki"), ("ク", "쿠 ku"), ("ケ", "케 ke"), ("コ", "코 ko"),
        ("サ", "사 sa"), ("シ", "시 si"), ("ス", "스 su"), ("セ", "세 se"), ("ソ", "소 so"),
        ("タ", "타 ta"), ("チ", "치 chi"), ("ツ", "츠 tsu"), ("テ", "테 te"), ("ト", "토 to"),
        ("ナ", "나 na"), ("ニ", "니 ni"), ("ヌ", "누 nu"), ("ネ", "네 ne"), ("ノ", "노 no"),
        ("ハ", "하 ha"), ("ヒ", "히 hi"), ("フ", "후 hu"), ("ヘ", "헤 he"), ("ホ", "호 ho"),
        ("マ", "마 ma"), ("ミ", "미 mi"), ("ム", "무 mu"), ("メ", "메 me"), ("モ", "모 mo"),
        ("ヤ", "야 ya"), ("", ""), ("ユ", "유 yu"), ("", ""), ("ヨ", "요 yo"),
        ("ラ", "라 ra"), ("リ", "리 ri"), ("ル", "루 ru"), ("レ", "레 re"), ("ロ", "로 ro"),
        ("ワ", "와 wa"), ("", ""), ("", ""), ("", ""), ("ヲ", "오 wo"),
        ("ン", "응 n"), ("", ""), ("", ""), ("", ""), ("", ""),
    ]
}
